<?php
/**
*
* Precise Similar Topics [English]
*
* @copyright (c) 2013 Matt Friedman
* @license GNU General Public License, version 2 (GPL-2.0)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine
//
// Some characters you may want to copy&paste:
// ’ » “ ” …
//

$lang = array_merge($lang, array(
	'PST_TITLE_ACP'		=> 'Похожие темы',
	'PST_EXPLAIN'		=> 'Расширение «Похожие темы» отображает список похожих (связанных) тем внизу на странице с сообщениями просматриваемой темы.',
	'PST_LEGEND1'		=> 'Основные настройки',
	'PST_ENABLE'		=> 'Отображать похожие темы',
	'PST_LEGEND2'		=> 'Настройки загрузки',
	'PST_LIMIT'			=> 'Количество похожих тем для отображения',
	'PST_LIMIT_EXPLAIN'	=> 'Здесь можно установить количество тем, которые будут показываться в блоке «Похожие темы». По умолчанию установлено отображение 5 похожих тем.',
	'PST_TIME'			=> 'Период поиска похожих тем',
	'PST_TIME_EXPLAIN'	=> 'Данная опция позволяет ограничить поиск похожих тем только среди новых тем форума (предотвратить поиск среди совсем старых тем). Например, если опция установлена на «30 дней», то поиск будет осуществляться только в темах, размещённым на форуме за последний месяц. По умолчанию установлен 1 год. Установите данную опцию на 99 лет, если хотите полностью исключить использование данной опции.',
	'PST_YEARS'			=> 'лет',
	'PST_MONTHS'		=> 'месяцев',
	'PST_WEEKS'			=> 'недель',
	'PST_DAYS'			=> 'дней',
	'PST_CACHE'			=> 'Размер кэша для расширения «Похожие темы»',
	'PST_CACHE_EXPLAIN'	=> 'Количество секунд, по прошествии которого очищается кэш расширения «Похожие темы». Установите данную опцию в 0, если хотите полностью отключить кэширование для данного расширения.',
	'PST_SENSE'			=> 'Чувствительность поиска',
	'PST_SENSE_EXPLAIN'	=> 'Здесь можно установить чувствительность поиска в пределах от 1 до 10. Используйте число меньше установленного, если не отображается ни одна похожая тема. Рекомендуемая настройка: если тип таблицы «phpbb_topics» установлен в InnoDB, то установите 1; для типа MyISAM установите 5.',
	'PST_LEGEND3'		=> 'Настройки форума',
	'PST_NOSHOW_LIST'	=> 'Не отображать в',
	'PST_NOSHOW_TITLE'	=> 'Не отображать похожие темы в',
	'PST_IGNORE_SEARCH'	=> 'Не искать в',
	'PST_IGNORE_TITLE'	=> 'Не осуществлять поиск похожих тем в',
	'PST_STANDARD'		=> 'Стандартные',
	'PST_ADVANCED'		=> 'Продвинутые',
	'PST_ADVANCED_TITLE'=> 'Кликните мышкой для того, чтобы открыть продвинутые установки расширения «Похожие темы»',
	'PST_ADVANCED_EXP'	=> 'Здесь вы можете указать конкретные разделы форума, откуда брать похожие темы. В блоке «Похожие темы» будут отображаться темы ТОЛЬКО из указанных здесь разделов.<br /><br />Если вы не выберете ни один раздел, то поиск похожих тем будет осуществляться по всем разделам форума.<br /><br />Можно выбрать несколько разделов с помощью клавиши <samp>CTRL</samp> (либо клавиши <samp>&#8984;CMD</samp> на компьютерах Mac) и левой кнопки мышки.',
	'PST_ADVANCED_FORUM'=> 'Продвинутые настройки',
	'PST_DESELECT_ALL'	=> 'Сбросить всё',
	'PST_LEGEND4'		=> 'Необязательные настройки',
	'PST_WORDS'			=> 'Игнорировать отдельные слова',
	'PST_WORDS_EXPLAIN'	=> 'Здесь можно прописать отдельные слова, которые не будут учитываться при поиске похожих тем. (Внимание: некоторые общие слова используемого вами языка уже игнорируются по умолчанию.) Каждое слово отделяется пробелом. Регистр слов не учитывается.',
	'PST_SAVED'			=> 'Настройки расширения «Похожие темы» обновлены',
	'PST_FORUM_INFO'	=> '«Не отображать в»: в выбранных здесь разделах блок «Похожие темы» отображаться не будет.<br />«Не осуществлять поиск похожих тем в»: в выбранных здесь разделах поиск похожих тем осуществляться не будет.',
	'PST_NO_COMPAT'		=> 'Расширение «Похожие темы» не совместимо с вашим форумом. Для использование данного расширения необходимо использование базы данных MySQL или PostgreSQL.',
	'PST_ERR_CONFIG'	=> 'Выбрано слишком много разделов форума. Пожалуйста, укажите меньшее количество разделов.',
));
